tutorials/pimpleFoam/t-junction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application turbFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;
maxCo           5;

functions
(
    probes
    {
        // Type of functionObject
        type probes;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libsampling.so");

        // Name of the directory for the probe data
        name probes;

        // Locations to be probed. runTime modifiable!
        probeLocations
        (
            (1E-6 0 0.01)           // at inlet
            (0.21 -0.20999 0.01)    // at outlet1
            (0.21  0.20999 0.01)    // at outlet2
            (0.21 0 0.01)           // at central block
        );

        // Fields to be probed. runTime modifiable!
        fields
        (
            p
            U
        );
    }
);


// ************************************************************************* //
